import { Feature } from "@/types/feature";

const Cow = () => <svg width="55" height="55" viewBox="0 0 128 128" xmlns="http://www.w3.org/2000/svg"
                 aria-hidden="true" role="img"
                 preserveAspectRatio="xMidYMid meet">
  <path d="M74.69 26.69s5.69-14.35 12.25-13.09c7.32 1.41 3.24 18.72 3.24 18.72l-15.49-5.63z" fill="#ffb903"></path>
  <path d="M55.27 24.29s-6.9-13.66-12.67-11.68s-1.55 19.99-1.55 19.99l14.22-8.31z" fill="#ffb903"></path>
  <path
      d="M47.94 25.28s1.97-2.39 18.44-1.83C82.85 24.01 92 29.79 92 29.79s5.68-4.35 11.22-6.24c8.23-2.8 19.3 1.91 20.17 3.71c.67 1.37-3.1 13.57-8.02 17.74c-5.49 4.65-11.4 4.36-11.4 4.36s-1.3 8.55-1.55 14.92c-.14 3.66.36 7.48.99 9.43c1.27 3.94 1.99 6.65 2.62 11.48c.53 4.03.62 7.94.62 7.94L41.33 76.66l6.61-51.38z"
      fill="#dfdfdf"></path>
  <path
      d="M38.79 75.54s10.23-2.72 12.95-4.18c2.32-1.24 15.35-6.95 16.33-24.54S56.63 24.11 54.94 23.68c-1.69-.42-7.79 1.22-11.36 3c-1.52.76-4.79 2.96-4.79 2.96s-6.48-6.76-16.61-7.74c-10.13-.99-17.74 4.36-17.88 5.07c-.14.7 3.8 14.53 11.01 19.34c2.1 1.4 4.8 2.03 6.65 2.28c4.84.66 6.69.06 6.69.06s-.7 7.46-.84 11.26s-.22 9.17-.66 13.05c-.28 2.49-3.66 9.1-3.75 13.98c-.06 3.24 15.39-11.4 15.39-11.4z"
      fill="#bc8954"></path>
  <path
      d="M65.74 74.41c12.16.29 14.99-1.83 23.28-1.27s18.85 9.29 17.85 21.82c-1 12.53-11.42 21.54-22.56 24.07c-11.14 2.53-35.99 2.82-47.7-3.52c-11.76-6.36-14.28-14.92-14.42-22.95S28.04 73 41.03 71.6s12.71 2.53 24.71 2.81z"
      fill="#ffd3b0"></path>
  <path
      d="M97.92 39.64c-2.08-3.64 0-9.39 6.57-10.89s13.14 1.5 13.14 1.5s-2.01 7.7-6.57 10.7c-3.85 2.54-10.14 3.94-13.14-1.31z"
      fill="#ffd3b0"></path>
  <path
      d="M25.09 29.13c-5.85-1.82-13.46.55-13.46.55s.24 3.38 2.64 6.65c1.44 1.96 3.59 4.31 6.99 5.43c7.98 2.63 10.96-2.12 11.61-4.28c.67-2.16-.55-6.1-7.78-8.35z"
      fill="#ffd3b0"></path>
  <ellipse transform="rotate(-81.802 49.515 57.292)" cx="49.52" cy="57.29" rx="6.85" ry="5.37" fill="#0a0a0a"></ellipse>
  <ellipse transform="rotate(-8.848 83.675 57.735)" cx="83.64" cy="57.73" rx="5.37" ry="6.86" fill="#0a0a0a"></ellipse>
  <path
      d="M73.14 99.52c-3-2.35-1.32-8.55 3.66-12.01c5.26-3.66 10.73-2.32 11.73-.09c1.31 2.91-.19 4.69-1.78 5.91c-1.51 1.15-3.57.94-4.88 1.69s-1.88 2.72-3.66 4.32c-1.65 1.47-4.07.95-5.07.18z"
      fill="#2e2f31"></path>
  <path
      d="M40.48 87.88c.94-4.22 7.67-4.06 12.48-.38c5.08 3.89 6.1 9.39 3.94 11.26c-2.46 2.14-4.84 1.07-6.32-.21c-1.44-1.24-1.95-2.24-3.07-3.27c-1.11-1.02-3.1-1.32-5.16-2.53c-1.9-1.11-2.27-3.07-1.87-4.87z"
      fill="#2e2f31"></path>
</svg>

const Increase = () => <svg width="55" height="55" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg">
  <g fill="none" fill-rule="evenodd">
    <rect width="10" height="23" x="15" y="33" fill="#4796E7" rx="3"/>
    <rect width="10" height="30" x="28" y="26" fill="#22BA8E" rx="3"/>
    <rect width="10" height="37" x="41" y="19" fill="#FFAF40" rx="3"/>
    <path stroke="#E43535" stroke-linecap="round" stroke-width="2" d="M10.4868562,28.2544738 C10.4868562,28.2544738 29.9645832,22.8690471 40.558199,9.75941372"/>
    <polygon fill="#E43535" points="43.132 1.632 49.132 12.632 37.132 12.632" transform="rotate(45 43.132 7.132)"/>
    <rect width="57" height="3" x="3" y="58" fill="#D8D8D8"/>
  </g>
</svg>

const Support = () => <svg width="55" height="55" viewBox="0 0 1024 1024" className="icon" version="1.1"
                           xmlns="http://www.w3.org/2000/svg">
  <path
      d="M618.666667 917.333333v-98.133333l55.466666 10.666667c61.866667 12.8 119.466667-32 123.733334-93.866667L810.666667 597.333333l61.866666-25.6c21.333333-8.533333 29.866667-34.133333 17.066667-55.466666L810.666667 384c-12.8-162.133333-104.533333-320-341.333334-320C226.133333 64 106.666667 243.2 106.666667 426.666667c0 78.933333 27.733333 147.2 70.4 204.8 38.4 53.333333 57.6 117.333333 57.6 181.333333v102.4h384z"
      fill="#FFB74D"/>
  <path d="M618.666667 917.333333v-98.133333L469.333333 789.333333v128z" fill="#FF9800"/>
  <path d="M714.666667 458.666667m-32 0a32 32 0 1 0 64 0 32 32 0 1 0-64 0Z" fill="#784719"/>
  <path
      d="M456.533333 64C262.4 64 106.666667 219.733333 106.666667 413.866667c0 236.8 128 243.2 128 396.8l55.466666-19.2c44.8-14.933333 83.2-49.066667 100.266667-93.866667l59.733333-145.066667L576 490.666667v-128s149.333333-81.066667 149.333333-219.733334C661.333333 89.6 548.266667 64 456.533333 64z"
      fill="#FF5722"/>
  <path
      d="M448 44.8c-12.8 0-21.333333 8.533333-21.333333 21.333333V362.666667c0 12.8 8.533333 21.333333 21.333333 21.333333s21.333333-8.533333 21.333333-21.333333V66.133333c0-12.8-8.533333-21.333333-21.333333-21.333333zM787.2 680.533333c-168.533333 0-219.733333-104.533333-221.866667-108.8-4.266667-10.666667-17.066667-14.933333-27.733333-10.666666-10.666667 4.266667-14.933333 17.066667-10.666667 27.733333 2.133333 6.4 64 134.4 260.266667 134.4 12.8 0 21.333333-8.533333 21.333333-21.333333s-10.666667-21.333333-21.333333-21.333334z"
      fill="#546E7A"/>
  <path d="M789.333333 704m-42.666666 0a42.666667 42.666667 0 1 0 85.333333 0 42.666667 42.666667 0 1 0-85.333333 0Z"
        fill="#37474F"/>
  <path
      d="M448 490.666667m-149.333333 0a149.333333 149.333333 0 1 0 298.666666 0 149.333333 149.333333 0 1 0-298.666666 0Z"
      fill="#37474F"/>
  <path d="M448 490.666667m-85.333333 0a85.333333 85.333333 0 1 0 170.666666 0 85.333333 85.333333 0 1 0-170.666666 0Z"
        fill="#546E7A"/>
</svg>

const Safe = () => <svg width="55" height="55" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg">
  <g>
<path fill='#B4E6DD' d="M52,8H12c-2.21,0-4,1.79-4,4v40c0,2.21,1.79,4,4,4h40c2.21,0,4-1.79,4-4V12C56,9.79,54.21,8,52,8z"/>

    <rect fill='#80D4C4' height="40" width="40" x="12" y="12"/>
    <g>
<rect fill='#32A48E' height="8.36" width="5.11" x="49.45" y="18.87"/>

      <rect fill='#32A48E' height="8.36" width="5.11" x="49.45" y="36.78"/>

</g>

    <path className="st3" fill='#FFFFFF'
          d="M26.48,20.89c-6.12,0-11.11,4.98-11.11,11.11s4.98,11.11,11.11,11.11S37.58,38.12,37.58,32   S32.6,20.89,26.48,20.89z M34.44,30.5h-3.82c-0.45-1.23-1.41-2.19-2.64-2.64v-3.82C31.25,24.65,33.82,27.23,34.44,30.5z M25.06,32   c0-0.78,0.64-1.42,1.42-1.42S27.9,31.22,27.9,32s-0.64,1.42-1.42,1.42S25.06,32.78,25.06,32z M24.98,24.04v3.82   c-1.23,0.45-2.19,1.41-2.64,2.64h-3.82C19.13,27.23,21.71,24.65,24.98,24.04z M18.52,33.5h3.82c0.45,1.23,1.41,2.19,2.64,2.64v3.82   C21.71,39.35,19.13,36.77,18.52,33.5z M27.98,39.96v-3.82c1.23-0.45,2.19-1.41,2.64-2.64h3.82C33.82,36.77,31.25,39.35,27.98,39.96   z"/>

</g>

</svg>

const featuresData: Feature[] = [
  {
    id: 1,
    icon: <Cow/>,
    title: "Оцифровка Животных",
    paragraph: "На нашей платформе вы преобразуете своих животных на ферме в Цифровые Финансовые Активы (ЦФА). Это предоставляет вам универсальный способ управления активами, снижает бюрократию и повышает эффективность обращения с вашими активами.",
    btn: "Learn More",
    btnLink: "/#",
  },
  {
    id: 2,
    icon: <Increase/>,
    title: "Управление Активами",
    paragraph: "Наша платформа обеспечивает удобные и эффективные методы отслеживания, обмена и продажи ваших ЦФА. Помимо этого, вы также можете использовать свои ЦФА как залог в финансовых операциях",
    btn: "Learn More",
    btnLink: "/#",
  },
  {
    id: 3,
    icon: <Safe/>,
    title: "Безопасность и Регулирование",
    paragraph: "Все операции в сервисе защищены передовыми методами шифрования, а также полностью соответствуют нормативным требованиям и стандартам Банка России",
    btn: "Learn More",
    btnLink: "/#",
  },
  {
    id: 4,
    icon: <Support/>,
    title: "Сопровождение и Консультации",
    paragraph: "Наша команда экспертов всегда готова помочь на каждом этапе процесса. Мы обеспечиваем круглосуточную поддержку и консультации для наших пользователей",
    btn: "Learn More",
    btnLink: "/#",
  },
];
export default featuresData;
